cases/compressible/k_matched/solidBodyAMI/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync   false;

patches
(
    {
        name    masterAMI;
        patchInfo
        {
            type    cyclicAMI;
            matchTolerance  0.001;
            transform       noOrdering;
            rotationAxis    (0 1 0);
            rotationCentre  (0.5 0 0);
            neighbourPatch  slaveAMI;
            method          faceAreaWeightAMI;
        }
        constructFrom patches;
        patches    (master);
    }

    {
        name    slaveAMI;
        patchInfo
        {
            type    cyclicAMI;
            matchTolerance  0.001;
            transform       noOrdering;
            rotationAxis    (0 1 0);
            rotationCentre  (0.5 0 0);
            neighbourPatch  masterAMI;
            method          faceAreaWeightAMI;
        }
        constructFrom patches;
        patches    (slave);
    }
);

// ************************************************************************* //
