cases/compressible/k_matched/solidBodyAMI/system/functions/residuals
residuals
{
     type            residuals;
     libs            ("libutilityFunctionObjects.so");

     writeControl    adjustableRunTime;
     writeInterval   1e-3;

     fields (p U h k omega);
}
