cases/compressible/k_matched/solidBodyAMI/system/functions/yPlus
yPlus
{
    libs            ("libfieldFunctionObjects.so");
    type            yPlus;
    writeControl    adjustableRunTime;
    writeInterval   1e-3;
}
